# GetDegreesOfFreedomCoordinateSystem Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundaryConditions..::..GetDegreesOfFreedomCoordinateSystem Method
BoundaryConditions Class See Also
---
Gets the origin and rotation of coordinate system that is used by translation and rotation parameters, like X Translation or Z Rotation.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public Transform GetDegreesOfFreedomCoordinateSystem()
```

Visual Basic
---
```text
Public Function GetDegreesOfFreedomCoordinateSystem As Transform
```

Visual C++
---
```text
public:
Transform^ GetDegreesOfFreedomCoordinateSystem()
```

# ### Return Value
The coordinate system. Origin contains the position of the start of the boundary conditions. BasisX, BasisY and BasisZ contain the directions of the axes in the global coordinate system.
# See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace